<template>
  <!--世界地图-->
  <div id="myChart" class="maps"></div>
</template>

<script>
  import world from 'echarts/map/json/world.json'
  export default {
    name: "worldMap",
    data(){
      return{

      }
    },
    mounted() {
      this.drawLine();
    },
    methods:{
      drawLine(){
        // 基于准备好的dom，初始化echarts实例
        const myChartContainer = document.getElementById('myChart');
        const myChart = this.$echarts.init(myChartContainer);
        this.$echarts.registerMap('world', world);
        // 绘制图表
        const optionMap = {
          backgroundColor: 'rgba(0,51,102, 1)',//地图背景颜色
          //视觉映射组件
          visualMap: {
            show: false,
            inRange: {//定义在选中范围中的视觉元素
              color: ['#2f6dbc','#5a98df','#2b5a9b','#3a85dc'],
            }
          },
          //提示框组件
          tooltip: {
            show: true,
            enterable: true,//鼠标是否可进入提示框浮层中，默认为false
            padding: [0 ,20],
            hideDelay: 0,//浮层隐藏的延迟，单位为ms
            textStyle: { //提示框浮层的文本样式
              fontSize: 14 //文字的字体大小默认14
            }
          },
          //地理坐标系组件 -- 这个是重点配置区
          geo: {
            map: 'world', // 表示中国地图
            roam: true,//是否开启鼠标缩放和平移漫游
            aspectScale: 1, //地图的长宽比
            zoom: 1.2,//当前视角的缩放比例
            //图形上的文本标签
            label: {
              show: true, // 是否显示对应地名
              textStyle: {
                color: '#ffffff'//地名字体颜色
              }
            },
            //地图区域的多边形 图形样式
            itemStyle: {
              areaColor: 'transparent',//模块内的颜色
              borderColor: '#00effc',//模块边框的颜色
              borderWidth: 1
            },
            //高亮状态下的多边形和标签样式
            emphasis: {
              itemStyle: {
                areaColor: '#1890ff',//移动上去的模块颜色
                borderColor: '#b7d25c',//移动上去的模块边框颜色
                borderWidth: 1
              },
              label: {
                show: true,
                color: '#b7d25c'//标签文字颜色
              }
            }
          },
          //系列列表
          series: [
            {//标记点样式
              type: 'scatter',
              coordinateSystem: 'geo',
              symbol: 'path://M105.932 1024H70.62a17.658 17.658 0 0 1-17.656-17.656V70.62c0-19.502 15.808-35.31 35.31-35.31 19.502 0 35.31 15.808 35.31 35.31v935.724A17.65 17.65 0 0 1 105.932 1024zM347.61 175.334l18.626 55.852 58.874 0.456c7.622 0.06 10.782 9.786 4.652 14.314L382.4 280.932l17.758 56.132c2.3 7.268-5.976 13.278-12.178 8.848l-47.898-34.236-47.898 34.236c-6.202 4.432-14.476-1.58-12.178-8.848l17.758-56.132-47.362-34.974c-6.13-4.528-2.97-14.254 4.652-14.314l58.874-0.456 18.626-55.852c2.418-7.234 12.646-7.234 15.056-0.002zM561.4 189.096l13.356 18.214 21.558-6.74c2.792-0.872 5.086 2.308 3.378 4.684l-13.196 18.33 13.072 18.418c1.692 2.386-0.624 5.55-3.41 4.658l-21.51-6.886-13.478 18.124c-1.746 2.346-5.474 1.122-5.486-1.804l-0.1-22.586-21.402-7.216c-2.772-0.934-2.758-4.858 0.02-5.774l21.448-7.074 0.252-22.584c0.032-2.92 3.77-4.122 5.498-1.764zM480.08 134.804l22.452 2.44 9.578-20.454c1.24-2.648 5.138-2.194 5.736 0.668l4.616 22.108 22.414 2.79c2.902 0.362 3.674 4.208 1.136 5.66l-19.6 11.222 4.274 22.178c0.554 2.872-2.866 4.796-5.032 2.83l-16.73-15.172-19.772 10.918c-2.56 1.414-5.446-1.244-4.246-3.912l9.26-20.6-16.494-15.43c-2.136-1.996-0.5-5.562 2.408-5.246zM515.576 353.688l-13.356 18.214-21.556-6.74c-2.792-0.872-5.086 2.308-3.378 4.684l13.196 18.33-13.072 18.418c-1.692 2.386 0.624 5.55 3.41 4.658l21.51-6.886 13.478 18.124c1.746 2.346 5.474 1.122 5.486-1.804l0.1-22.586 21.402-7.216c2.772-0.934 2.758-4.858-0.02-5.774l-21.448-7.074-0.252-22.584c-0.036-2.922-3.772-4.12-5.5-1.764zM596.894 302.67l-22.452 2.44-9.578-20.454c-1.24-2.648-5.138-2.194-5.736 0.668l-4.616 22.108-22.414 2.79c-2.902 0.362-3.674 4.208-1.136 5.66l19.6 11.222-4.274 22.178c-0.554 2.872 2.866 4.796 5.032 2.83l16.73-15.172 19.772 10.918c2.56 1.414 5.446-1.244 4.246-3.912l-9.26-20.6 16.494-15.43c2.136-1.996 0.5-5.562-2.408-5.246z',
              symbolSize: 30,//标记点大小
              symbolOffset: ['0', '-80%'],//标记点位置
              color: '#ff0000',
              data: [{//标记点数据
                name: '我是北京的经纬度',
                value: [116.3, 39.9]
              }
              ],
            },{
              name: '启动次数', //浮动框的标题
              type: 'map', //地图主要用于地理区域数据的可视化
              geoIndex: 0,//默认情况下，map series 会自己生成内部专用的 geo 组件。但是也可以用这个 geoIndex 指定一个 geo 组件。这样的话，map 和 其他 series（例如散点图）就可以共享一个 geo 组件了。并且，geo 组件的颜色也可以被这个 map series 控制，从而用 visualMap 来更改
              data: [{
                "name": "亚洲",
                "value": 599
              }]
            }
          ]
        }
        //myChart.showLoading();
        myChart.setOption(optionMap,true);//是否不跟之前设置的 option 进行合并，默认为 false，即合并
        window.onresize=function(){
          myChart.resize();
          //myChart.hideLoading();
        }

      }
    }
  }
</script>

<style>

</style>
